{
  "search_query": {
    "institution": "Community College of Beaver County",
    "successful_variation": "Community College of Beaver County",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Community+College+of+Beaver+County&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ACCT 110",
      "course_title": "Financial Accounting",
      "credits": "3.00",
      "description": "The accounting cycle in various types of enterprises is examined. Included is the practical application of the principles learned. Honors Option Available. Financial Accounting Honors examines the accounting cycle in various types of enterprises. Included is the practical application of the principles learned. Part of each class will be lecture, problem-solving as related to the lecture, discussion and homework assignments as required. You are also encouraged to explore the internet for additional accounting topics and related subject matter. Emphasis will be placed on analyzing international companies, evaluating accounting systems used in the global environment and creating solutions for today's accounting information systems. 3-0-3",
      "institution": "Community College of Beaver County"
    },
    {
      "course_id": "ACCT 111",
      "course_title": "Managerial Accounting",
      "credits": "3.00",
      "description": "This course is a continuation of Accounting I with emphasis on the use of accounting data in decision making, cost accounting and statement analysis. 3-0-3 Prerequisite: ACCT110",
      "institution": "Community College of Beaver County"
    },
    {
      "course_id": "ACCT 200",
      "course_title": "Quickbooks",
      "credits": "3.00",
      "description": "Quickbooks is used to model automated accounting systems and demonstrate their use in maintaining accounting information and improving decision making from both the business owner and accountant's perspective. The software will be used to create an appropriate chart of accounts, record all transcactions including payroll for a complete business cycle and customize standard reports for various types of enterprises. The use of information generated by the system to improve decision-making will be discussed. 3-0-3",
      "institution": "Community College of Beaver County"
    },
    {
      "course_id": "ACCT 211",
      "course_title": "Intermediate Accounting I",
      "credits": "3.00",
      "description": "This course will examine the relationship of the conceptual framework and generally accepted accounting principles to the preparation of financial statements and their use in decision-making. Analysis of asset accounts and the implication of account balances will be discussed in detail along with the reporting issues associated with the Balance Sheet presentation of assets. 3-0-3 Prerequisite: ACCT11",
      "institution": "Community College of Beaver County"
    },
    {
      "course_id": "ACCT 212",
      "course_title": "Intermediate Accounting II",
      "credits": "3.00",
      "description": "This course will examine the relationship of the conceptual framework and generally accepted accounting principles to the preparation of financial statements and their use in decision-making. Analysis of liability and equity accounts and the implication of account balances will be discussed in detail along with the reporting issues associated with the Balance Sheet presentation of liabilities and equity. Special consideration is given to revenue recognition issues, accounting changes and full disclosure requirements in the era of Sarbanes-Oxley. 3-0-3 Prerequisite: ACCT211",
      "institution": "Community College of Beaver County"
    },
    {
      "course_id": "ACCT 215",
      "course_title": "Tax Accounting",
      "credits": "3.00",
      "description": "Accounting principles of tax accounting are stressed including types of returns, includable and excludable income, expenses, deductions, inventory methods and depreciation. 3-0-3 Prerequisite: ACCT111",
      "institution": "Community College of Beaver County"
    },
    {
      "course_id": "ACCT 216",
      "course_title": "Cost Accounting",
      "credits": "3.00",
      "description": "Techniques and procedures used in cost determination; process and job order methods, standard costs and cost analysis and control are included in this course. 3-0-3 Prerequisite: ACCT111",
      "institution": "Community College of Beaver County"
    },
    {
      "course_id": "ANTH 101",
      "course_title": "Principles of Anthropology",
      "credits": "3.00",
      "description": "This course will address the basics of anthropology including the terminology, theories, its history and research methods utilized in the field. Human evolution, both biological and cultural, cultural evolution and cultural variation will be addressed as will the application of anthropology in the modern world. 3-0-3",
      "institution": "Community College of Beaver County"
    },
    {
      "course_id": "AVIC 160",
      "course_title": "Flight Theory Fundamentals I",
      "credits": "7.00",
      "description": "This course is designed to provide the basis for Air Traffic Control Training. The student will learn the principles of flight, basics of air traffic control, weather facts, and navigational equipment and procedures. 7-0-7",
      "institution": "Community College of Beaver County"
    },
    {
      "course_id": "AVIC 180",
      "course_title": "Flight Theory Fundamentals II",
      "credits": "7.00",
      "description": "Comprehensive course of instruction which emphasizes learning, interpreting, and applying weather data and radio fundamentals used by air traffic controllers and pilots flying under instrument flight rules conditions. 7-0-7 Prerequisite: AVIC 160",
      "institution": "Community College of Beaver County"
    }
  ],
  "timestamp": "2025-08-10T04:22:15.797712"
}