{
  "search_query": {
    "institution": "Cornell University",
    "successful_variation": "Cornell University",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Cornell+University&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "CEPL 551",
      "course_title": "Introduction to Project Leadership",
      "credits": "3.00",
      "description": "Everyone needs to manage projects - the complex set of tasks that require the marshaling of resources to accomplish defined objectives. Managers and leaders are increasingly finding that mastery of the technical skills of project management is not sufficient to ensure the success of a project; project leadership skills are critical to understanding the uncertainty that surrounds projects and developing a management and leadership approach that leverages the capabilities and collective intelligence of the team. This course introduces the concept of project leadership as being distinct from project management. Project leadership builds upon the technical skills to manage a project and focuses on developing new skills to identify and manage project uncertainty. Who Should Take This Course This course is essential for Project Management Professionals (PMPs), project managers, and functional managers charged with leading a cross-functional or project team to success. It is appropriate for business leaders, mid-level managers, and project managers who need to learn the critical leadership skills necessary to ensure the high performance of a project team. Course Format This course contains the following modules: Definging Project Management Organizational Design Methods of Integration The Role of the Project Manager Overcoming Problems to Project Managers The Matrix Organization Managing Uncertainty The Project Manager at the Personal Level Benefits to Learner Learners who complete this course will be able to: Describe why project management exists and the various forms it can take Apply appropriate methods for helping a project to adapt to various types of environmental uncertainty Utilize management/leadership research and theory to define a set of key success factors and behaviors for the project manager Overcome the typical challenges associated with different forms of the project manager's role Certificate Information This course can be applied to the following certificates: Project Leadership Sponsoring School Cornell University's College of Engineering",
      "institution": "Cornell University"
    },
    {
      "course_id": "CEPL 552",
      "course_title": "Project Teams:Mining Collective Intelligence",
      "credits": "3.00",
      "description": "Today's projects are increasingly collaborative, drawing in learners from inside and outside of an organization, and often global in scale. This diversity of project team membership provides the opportunity to mine the collective intelligence of the team which, when properly managed, can exceed the sum if the capabilities of the individuals. This team intelligence is the project leader's key resource to managing uncertainty and leading the project to success. The project leader is ultimately responsible for ensuring that the project team works effectively as a group and is able to manage the \"triangle of relationships\" - the complex dynamic of relationshipbetween the individual, the project manager, and the project team. Who Should Take This Course This course is essential for Project Management Professionals (PMPs), project managers, and functional managers charged with leading a cross-functional or project team to success. It is appropriate for business leaders, mid-level managers, and project managers who need to learn the critical leadership skills necessary to ensure the high performance of a project team. Course Format This course contains the following modules: Mission to Mars Mars 2010 What is a team Characteristics of a Team How Teams Function and Grow Processes and Challenges for Project Teams Creating and Maintaining Cohesion Work Socialization Group Facilitation Skills Challenges for Project Managers and Their Teams Benefits to Learner Learners who complete this course will be able to: Build a cohesive and effective project team Understand how and when to \"mine\" the collective intelligence of the teamto better cope with complexity, difficulty, and ambiguity Certificate Information This course can be applied to the following certificates: Project Leadership Sponsoring School Cornell University's College of Engineering",
      "institution": "Cornell University"
    },
    {
      "course_id": "CEPL 553",
      "course_title": "Dealing with Difference",
      "credits": "3.00",
      "description": "Successful collaboration and team functioning hinges on attaining an understanding and respect of difference and diversity. Difference can be at the national, personal, or cultural level, and managed well, can be a tremendous asset to a project team. This course explores the ways in which differences can create disconnects within a team and how those disconnects can be overcome. The best project leaders are well versed on the issues that can fragment a high-performing project team or undermine the group's collective intelligence, and knows how to deal with them effectively. Difference is an important component of any team. Taking advantage of the collective intelligence by tapping into diverse thoughts and expertise is one of the key roles of a project leader. This course will teach you how to master these skills. Who Should Take This Course This course is essential for Project Management Professionals (PMPs), project managers, and functional managers charged with leading a cross-functional or project team to success. It is appropriate for business leaders, mid-level managers, and project managers who need to learn the critical leadership skills necessary to ensure the high performance of a project team. Course Format This course contains the following modules: National Culture The Importance of Difference Defining National Culture Diagnosing and Overcoming Cultural Challenges Personality Defining Personality Overcoming Personality-Related Challenges Learning Styles Defining and Overcoming Challenges Related to Differences in Learning Styles Difference and the Project Manager Benefits to Learner Learners who complete this course will be able to: Analyze project teams for potential disconnects as a result of cultural, personality-related, or functional differencesUse a cash-flow timeline to conceptualize time-value-of-money problems Minimize the negative effects that difference has on a project team Certificate Information This course can be applied to the following certificates: Project Leadership Sponsoring School Cornell University's College of Engineering",
      "institution": "Cornell University"
    },
    {
      "course_id": "CEPL 554",
      "course_title": "Earned Value Management",
      "credits": "3.00",
      "description": "In highly uncertain project environments, project managers must make sure they always know how their project is performing against reported timelines and budgets. The earned value method is a key control system that allows project managers to quickly calculate metrics that describe the work performed against expectations. This course focuses on the methods of calculating the right metrics, interpreting the data, and making adjustments to the project plan to compensate if a project is off target. Initial emphasis is placed on understanding control systems, the methodology of Earned Value Management, and the tools a project manager can use to measure project progress, including Work Breakdown Structures, network diagrams, scheduled, budgets, and Gantt charts. Who Should Take This Course This course is essential for Project Management Professionals (PMPs), project managers, and functional managers charged with leading a cross-functional or project team to success. It is appropriate for business leaders, mid-level managers, and project managers who need to learn the critical leadership skills necessary to ensure the high performance of a project team. Course Format This course contains the following modules: The Earned Value Method Control Systems Calculations and Forecasts Motivating Employees Defining and Diagnosing Motivation The Psychological Contract Managing Yourself as a Resource Designing Jobs Appropriately Helping People to Believe in Themselves Coaching and Development How People Learn Coaching and Development Benefits to Learner Learners who complete this course will be able to: Apply an earned value method for assessing degrees of project completion Create accurate forecasts to communicate time and budget required for project completion Diagnose and resolve issues of demotivation Apply best practices in coaching and development situations Certificate Information This course can be applied to the following certificates: Project Leadership Sponsoring School Cornell University's College of Engineering",
      "institution": "Cornell University"
    },
    {
      "course_id": "CEPL 555",
      "course_title": "Influence Without Authority",
      "credits": "3.00",
      "description": "Project Leadership is about exercising influence to get tasks and projects accomplished even when you may not have the formal authority to mandate action. Whether you work in a matrix organization or lead a cross-functional team, your goal as a project leader is organize the actions of your team members to ensure the successful completion of a project. To exercise influence without authority, you need to see your organization as a political system, understand the nature of power and influence in your organization, understand your own personal sources of influence, and know how to leverage your own personal political power. Who Should Take This Course This course is essential for Project Management Professionals (PMPs), project managers, and functional managers charged with leading a cross-functional or project team to success. It is appropriate for business leaders, mid-level managers, and project managers who need to learn the critical leadership skills necessary to ensure the high performance of a project team. Course Format This course contains the following modules: Power and Influence The Nature of Power and Influence Sources of Power in an organization Strategies of Influence Introduction to Strategies of Influence Retribution-based Influence Rationality-based Influence Reciprocity-based Influence Appropriate Selection and Implementation The Power Motivation Inventory Sources of Power Implementing to Maximize Influence Benefits to Learner Learners who complete this course will be able to: Develop an understanding of organizations as political systems Explain the personal and positional sources of power in organizations Describe the basic types of strategies for exercising influence; develop an understanding of the conditions that would make each appropriate; and build skill in applying those strategies to a variety of influence opportunities Develop a plan for increasing personal potency in one's organization Certificate Information This course can be applied to the following certificates: Project Leadership Sponsoring School Cornell University's College of Engineering",
      "institution": "Cornell University"
    },
    {
      "course_id": "CEPL 556",
      "course_title": "Conflict Resolution",
      "credits": "3.00",
      "description": "Conflict is inevitable and, as a project leader, you need to be able to resolve it quickly and effectively. Conflict is inherent in almost every project for a multitude of reasons including project complexity, misaligned stakeholders, diverse team members, scarcity of resources, and matrix organizational structures that by definition place two sets of managerial values and priorities into tension with each other. The best project leaders have a welldeveloped capacity for managing and resolving conflict. Successful project leaders can diagnose and resolve conflict in a manner that enhances team cohesiveness and improves the likelihood of successful results. Who Should Take This Course This course is essential for Project Management Professionals (PMPs), project managers, and functional managers charged with leading a cross-functional or project team to success. It is appropriate for business leaders, mid-level managers, and project managers who need to learn the critical leadership skills necessary to ensure the high performance of a project team. Course Format This course contains the following modules: Conflict Resolution in Context Organizational Conflict Avoiding Conflict Focusing on Completion Accommodation Compromisation Collaboration Principled Negotiation Separating People from Problems Focusing on Interests Generating Options Evaluating Options Additional Considerations Benefits to Learner Learners who complete this course will be able to: Explain why conflict is inherent in a project Describe approaches to resolving conflict and explain how your conflict mode does or does not support these approaches Discuss the elements of the principled negotiation approach to conflict resolution Certificate Information This course can be applied to the following certificates: Project Leadership Sponsoring School Cornell University's College of Engineering",
      "institution": "Cornell University"
    },
    {
      "course_id": "CESYS 501",
      "course_title": "Product and Service Design",
      "credits": "3.00",
      "description": "Learn how to create sustainable competitive advantage for your business by applying proven system design principles; design better products and services. System design is a formal approach to the process that maximizes the chances of discovering the right concept, selling it to internal stakeholders, identifying uses for it in the marketplace, and gathering requirements before starting the next stage of planning. This course will provide you with the skills you need to identify the right idea, prepare it for internal buy-in, and get it to market. Unique in its behavioral emphasis, the course addresses the concept of customer-focused design and the importance of thinking through what it will be like to use the product or service. You will learn how to brainstorm and select a concept, write a mission statement, identify the internal stakeholders, gain a comprehensive understanding of the customer experience, and define functional requirements for your product or service. Who Should Take This Course Anyone whose job involves developing, marketing, or managing products or services should take this course. Engineers and other technical specialists will learn how to best apply their talents, and marketers and managers will gain a deep understanding of the origins and impact of customer behavior. Course Format This course contains the following modules: Developing the Concept An Introduction to the Process Select and Sketch the Concept Identify and Communicate to Stakeholders Define the Context Defining the Functional Requirement Collect and Prioritize Use Cases Derive Requirements from Use Case Behaviors Summarize and Finalize Requirements Benefits to Learner Learners who complete this course will be able to: Initiate a design project and enrich the concept with detailed behaviors Understand the benefits of customer-based design Know when and how your organization can use this process Use this process to define a design problem Initiate a design project and enrich the concept with detailed behaviors Create a mission statement and identify a customer need Develop a workable product or service Develop a user-based view of the system Define system boundaries Understand work products required in early design stages and have a process for driving to those products Certificate Information This course can be applied to the following certificates: A Systems Approach to Product and Service Design Sponsoring School Cornell University's College of Engineering",
      "institution": "Cornell University"
    },
    {
      "course_id": "CESYS 502",
      "course_title": "Targeting Product and Service Designs to Customer's Needs",
      "credits": "3.00",
      "description": "In the first course in this certificate program, Getting Started on Product and Service Design, you've identified a promising new product or service that can give your company a competitive edge. Now it's time to align your design plan more closely with what customers want, set targets for performance, and achieve them. This course will help you answer tough questions faced by engineers, product managers, marketers, and CEOs: How do you calibrate and measure customer needs How do you benchmark the competition to see how to gain the advantage over them How do you rank and weight product attributes in order to decide what to emphasize How do you define technical requirements in a customer-driven way If your role involves the creation, quality, or management of products and services, this course will give you field-tested, repeatable methods for building demand into your product or service. You will learn how to set and meet objectives for your product that are based on customer needs, business objectives, and competitor gaps. Who Should Take This Course Anyone whose job involves developing, marketing, or managing products or services should take this course. Engineers and other technical specialists will learn how to best apply their talents, and marketers and managers will gain a deep understanding of the origins and impact of customer behavior. Course Format This course contains the following modules: Identify Customer Needs Conduct a Contextual Inquiry Summarize Product or Service Objectives Measure Needs Use the Goal-Question-Metric (GQM) Method Rank and Weigh Product Objectives Benchmark the Competition Determine Technical Requirements and the Customer Value Proposition Use the House of Quality Technique Identify the Customer Value Proposition Benefits to Learner Learners who complete this course will be able to: Lead a diverse product development team Conduct a contextual inquiry to identify customer needs Measure how well product or service requirements meet customer needs Use a step-by-step process to translate customer needs into technical requirements Generate a clearly articulated Customer Value Proposition (CVP) Apply systems thinking skills using the customer affinity process Certificate Information This course can be applied to the following certificates: A Systems Approach to Product and Service Design Sponsoring School Cornell University's College of Engineering",
      "institution": "Cornell University"
    },
    {
      "course_id": "CESYS 503",
      "course_title": "Exploring the Design Space and Optimizing the Design",
      "credits": "3.00",
      "description": "In Exploring the Design Space and Optimizing the Design, learn to view your concept from many different angles, examine the requirements and components of your concept in greater detail, and how to transition successfully from raw concept to polished design. You'll learn how to avoid the pitfalls of rushing the process and neglecting to examine your concept from all angles. In this course, you'll examine competitor products in depth, collaborating with customer experts, and performing relevant patent searches-all of which will take your design one step closer to market. Once you've learned how to explore the design space and optimize the design properly, you'll be prepared to turn a concept into a market-ready solution. Managers will learn how to answer future customer queries about the product, and how to anticipate sales and marketing angles. Engineers and other technical employees will learn how to get the most value out of their designs, and how to prepare concepts for the next stages of design. Who Should Take This Course Anyone whose job involves developing, marketing, or managing products or services should take this course. Engineers and other technical specialists will learn how to best apply their talents, and marketers and managers will gain a deep understanding of the origins and impact of customer behavior. Course Format This course contains the following modules: Explore the Design Space Reasons to Explore Discover and Organize Concepts Clarify the Problem and Decompose Functions Brainstorm and Research Organize, Prune and Expand Concept Fragments Combine Concepts to Create Solutions Generate Integrated Concepts List Subsystems Optimize Design Choices Tradeoff Analysis Optimize Parameters and Define the Product Family Benefits to Learner Learners who complete this course will be able to: Explain the reasons for exploring a broad design space Discover and organize concepts relevant to a design problem Generate integrated design solutions from initial concepts that satisfy the product mission Use a trade study (tradeoff analysis) technique to optimize design choices Avoid the trap of going with a first idea or a one-shot product Use Six Sigma problem-solving Develop a product platform business strategy Gain the confidence to lead and manage a development team Make decisions that lead to balanced designs Avoid the pitfalls of poor team dynamics Certificate Information This course can be applied to the following certificates: A Systems Approach to Product and Service Design Sponsoring School Cornell University's College of Engineering",
      "institution": "Cornell University"
    },
    {
      "course_id": "CESYS 504",
      "course_title": "Thinking Through the Structure of System Design",
      "credits": "3.00",
      "description": "The best idea in the world is worth nothing to your business if it can't be executed. Getting execution right begins with giving design and development teams the precise information they need to move from the inputs-functions, requirements, interfaces, and components-to a finished product or service. A concept cannot be handed off unless the system design has been revisited to make certain that you can summarize its behavior, understand how the system interacts with its subsystems, and manage and predict the different changes that the system will undergo. Communicating this information clearly to all design stakeholders can be challenging. In this course you will learn how to speak that common language, remove ambiguity from the design process, and ensure a smooth handoff from the concept design team to those who will execute the concept. A wide array of stakeholders (from engineers to managers) are involved in this transition, and the successful launch of a product or service requires an understanding of the language and processes of architecture. Through this course, you'll acquire a detailed, point-by-point knowledge of the design architecture process and come one step closer to going to market with a winning product or service. Who Should Take This Course Anyone whose job involves developing, marketing, or managing products or services should take this course. Engineers and other technical specialists will learn how to best apply their talents, and marketers and managers will gain a deep understanding of the origins and impact of customer behavior. Course Format This course contains the following modules: Designing System Behavior and Functional Control Get System Architecture Right Map Behaviors and Set Targets Extract Functional Requirements Design the Functional Control Design the Structure Analyze Subsystem Interfaces Allocate Technical Performance Targets Benefits to Learner Learners who complete this course will be able to: Describe your product or service in a way that enables teams of people to work together on its design Apply the sequence of behavior-function-structure to the development of systems design Define the sub-systems of a design concept Understand the role of systems architecture Understand the behavioral basis for customer-based architecture Certificate Information This course can be applied to the following certificates: A Systems Approach to Product and Service Design Sponsoring School Cornell University's College of Engineering",
      "institution": "Cornell University"
    }
  ],
  "timestamp": "2025-08-10T23:52:05.804449"
}