{
  "search_query": {
    "institution": "Dakota State University",
    "successful_variation": "Dakota State University",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Dakota+State+University&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ACCT 205",
      "course_title": "Introduction to Accounting For Not- For- Profit Management",
      "credits": "3.00",
      "description": "An introduction to the basic financial and accounting principles related to not-for-profit entities. 3",
      "institution": "Dakota State University"
    },
    {
      "course_id": "ACCT 210",
      "course_title": "Principles of Accounting I",
      "credits": "3.00",
      "description": "A study of fundamental accounting principles and procedures such as journalizing, posting, preparation of financial statements, and other selected topics. Accounting is emphasized as a service activity designed to provide the information about economic entities that is necessary for making sound decisions. Prerequisite: Sophomore or above standing or consent of instructor. 3",
      "institution": "Dakota State University"
    },
    {
      "course_id": "ACCT 211",
      "course_title": "Principles of Accounting II",
      "credits": "3.00",
      "description": "A continuation of ACCT 210 with emphasis on partnership and corporate structures, management decision-making, cost control, and other selected topics. Prerequisite: ACCT 210. 3",
      "institution": "Dakota State University"
    },
    {
      "course_id": "ACCT 291",
      "course_title": "Independent Study",
      "credits": "3.00",
      "description": "A student independently studies an accounting topic with help from instructor. 1-4",
      "institution": "Dakota State University"
    },
    {
      "course_id": "ACCT 305",
      "course_title": "Analysis of Financial Statements",
      "credits": "3.00",
      "description": "The skeptical analysis of corporate financial statements including ratio, vertical, and horizontal analyses, interpretation of disclosure statements, consideration of the impact of inflation and taxes and accounting assumptions, market impact of accounting choices, earning quality and earning management, mergers and acquisitions, accounting-based trading strategies, restatement and forecasting of financial statements, and accounting and auditing ethics and standards. Prerequisite: ACCT 211 3",
      "institution": "Dakota State University"
    },
    {
      "course_id": "ACCT 310",
      "course_title": "Intermediate Accounting I",
      "credits": "3.00",
      "description": "Involves the intensive study of financial accounting standards, both in theory and practice, as they relate to the preparation and analysis of financial statements. Accounting problems and their impact on the financial statements are addressed in regard to current assets, fixed assets, intangible assets, liabilities, and other selected topics. Prerequisite: ACCT 211. 3",
      "institution": "Dakota State University"
    },
    {
      "course_id": "ACCT 311",
      "course_title": "Intermediate Accounting II",
      "credits": "3.00",
      "description": "Provides an intensive study of accounting standards, both in theory and practice, as they relate to the preparation and analysis of financial statements. Accounting problems and their impact on the financial statements are addressed in regard to liabilities, investments, stockholders' equity, leases, pensions, tax allocation and other selected topics. Prerequisite: ACCT 310 or consent of instructor. 3",
      "institution": "Dakota State University"
    },
    {
      "course_id": "ACCT 320",
      "course_title": "Cost Accounting",
      "credits": "3.00",
      "description": "The study of principles and techniques for accumulating, reporting, and analyzing cost information for decision-making and external reporting. The use of cost accounting systems for planning and controlling cost responsibility centers is emphasized. Consideration is given to the appropriate use of various cost accounting methods such as activity-based costing, target costing, and just-in-time management techniques in service and manufacturing industries. Prerequisite: ACCT 211. 3",
      "institution": "Dakota State University"
    },
    {
      "course_id": "ACCT 360",
      "course_title": "Accounting Systems",
      "credits": "3.00",
      "description": "Provides an understanding of the patterns of flow of accounting information in business, principles of internal control, and the use of computers in current and future accounting systems. Topics include concepts of accounting information systems, flowcharting and analysis of manual and computerized transaction cycles, decision support systems, electronic commerce, management reporting systems, control and audit of complex computerized information systems, and the development of accounting information systems. Prerequisite: ACCT 211. 3",
      "institution": "Dakota State University"
    },
    {
      "course_id": "ACCT 406",
      "course_title": "Accounting For Entrepreneurs",
      "credits": "3.00",
      "description": "Accounting concepts and practices for entrepreneurs/small business owners. Emphasis given to the use of accounting tools to solve small business problems. 3",
      "institution": "Dakota State University"
    }
  ],
  "timestamp": "2025-08-10T21:02:20.943327"
}