{
  "search_query": {
    "institution": "Illinois Institute of Technology",
    "successful_variation": "Illinois Institute of Technology",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Illinois+Institute+of+Technology&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "AAH 119",
      "course_title": "History of World Architecture I",
      "credits": "3.00",
      "description": "Comprehensive background as well as concentration on individual cultures and their architects from ancient to modern times. Discussion of architectures from around the world. Specific details and expression of more generalized theories and strategies will be explored. 3. 000 Credit Hours 3. 000 Lecture hours Levels: Undergraduate Schedule Types: Lecture College of Science & Letters College Humanities Department Course Attributes: Communications Requirement, Humanities Requirement",
      "institution": "Illinois Institute of Technology"
    },
    {
      "course_id": "AAH 120",
      "course_title": "History of World Architecture II",
      "credits": "3.00",
      "description": "Comprehensive background as well as concentration on individual cultures and their architects from ancient to modern times. Discussion of architectures from around the world. Specific details and expressions of more generalized theories and strategies will be explored. 3. 000 Credit Hours 3. 000 Lecture hours Levels: Undergraduate Schedule Types: Lecture College of Science & Letters College Humanities Department Course Attributes: Communications Requirement, Humanities Requirement",
      "institution": "Illinois Institute of Technology"
    },
    {
      "course_id": "AAH 301",
      "course_title": "Thinking About Art",
      "credits": "3.00",
      "description": "A course designed for those who find art pleasing, meaningful, or significant and who want to extend the range of their sensibilities. Theories of art will be studied for insight, as well as for historical interest and continuity. Works of art will be studied for their intrinsic value, for their relation to ideas and events, and as cultural artifacts. Regular visits to area museums and galleries will be required. 3. 000 Credit Hours 3. 000 Lecture hours Levels: Undergraduate Schedule Types: Lecture College of Science & Letters College Humanities Department Course Attributes: Communications Requirement, Humanities Requirement",
      "institution": "Illinois Institute of Technology"
    },
    {
      "course_id": "AAH 322",
      "course_title": "19th Century American Art and Culture",
      "credits": "3.00",
      "description": "This course explores the artistic history of the United States, from an agrarian society that developed into an industrialized nation with a distinguished national art. This broad chronological survey begins with the colonial art of Copley, Peale, West and Stuart, followed by the nation building iconography of the Hudson River School. The art of Mount and Bingham reflect antebellum culture, followed by Johnson in post-Civil War America on the eve of the Gilded Age. Finally, the course examines the realism of Homer and Eakins, defining a truly American iconography. 3. 000 Credit Hours 3. 000 Lecture hours Levels: Undergraduate Schedule Types: Lecture College of Science & Letters College Humanities Department Course Attributes: Communications Requirement, Humanities Requirement",
      "institution": "Illinois Institute of Technology"
    },
    {
      "course_id": "AAH 323",
      "course_title": "20th Century American Art and Culture",
      "credits": "3.00",
      "description": "This broadly chronological survey begins with Sargent and Cassett in the context of European traditions. Impressionism comes to America through the art of Chase and Hassam, and other members of 'The Ten'. Early Modernism follows with Henri, Glackens and Sloan, leading artists of 'The Eight' and the Ashcan painters, including Bellows. The major regionalists include Benton, Wood, and O'Keefe with Hopper emerging as the most significant artist of the century. With New York as the new center of Western art in post-war America, Pollock defines abstract Expressionism, followed by Warhol and Pop-Art. 3. 000 Credit Hours 3. 000 Lecture hours Levels: Undergraduate Schedule Types: Lecture College of Science & Letters College Humanities Department Course Attributes: Communications Requirement, Humanities Requirement",
      "institution": "Illinois Institute of Technology"
    },
    {
      "course_id": "AAH 380",
      "course_title": "Topics in Art and Architecture History",
      "credits": "3.00",
      "description": "An investigation into a topic of current or enduring interest in Art and/or Architectural History which will be announced by the instructor when the course is scheduled. 3. 000 Credit Hours 3. 000 Lecture hours Levels: Undergraduate Schedule Types: Lecture College of Science & Letters College Humanities Department Course Attributes: Communications Requirement, Humanities Requirement",
      "institution": "Illinois Institute of Technology"
    },
    {
      "course_id": "AAH 468",
      "course_title": "Five Centuries of Contemporary French Architecture",
      "credits": "3.00",
      "description": "By studying theoretical texts written by five very influential architects over five centuries, the course will provide insight into the qualities of national exceptionalism marked by an innovative and transformative tradition. This tradition has been a central source of the modernist agenda as much as of French culture. This course prepares students for ARCH 469, a course that is part of the Semester Abroad Program. This course may be used for an architectural history elective or a humanities elective; however, it may not be used for both. Students who are not committed to, or do not plan to enroll in, the Semester Abroad Program may also take this course if space is available. 3. 000 Credit Hours 3. 000 Lecture hours Levels: Graduate Doctoral, Graduate, Undergraduate Schedule Types: Lecture College of Science & Letters College Humanities Department Course Attributes: Communications Requirement, Humanities Requirement",
      "institution": "Illinois Institute of Technology"
    },
    {
      "course_id": "AAH 491",
      "course_title": "Independent Reading and Research",
      "credits": "6.00",
      "description": "For advanced students.(Credit: Variable). Instructor permission required. 1. 000 TO 6.000 Credit Hours 1. 000 TO 6.000 Other hours Levels: Undergraduate Schedule Types: Independent Study/Research College of Science & Letters College Humanities Department Course Attributes: Communications Requirement, Humanities Requirement",
      "institution": "Illinois Institute of Technology"
    },
    {
      "course_id": "AAH 494",
      "course_title": "Senior",
      "credits": "3.00",
      "description": "Seminar Theories of Architecture in Historical Perspective An investigation of the development of formal architectural theory. Writings by architects from antiquity to the present will be studied, analyzed, and criticized. The relation between theory and practice will be emphasized. The implications of particular theories for such other questions as environment, tradition, change, innovation, revolution, and meaning will be considered. 3. 000 Credit Hours 3. 000 Lecture hours Levels: Undergraduate Schedule Types: Seminar College of Science & Letters College Humanities Department Course Attributes: Communications Requirement, Humanities Requirement",
      "institution": "Illinois Institute of Technology"
    },
    {
      "course_id": "ACCT 506",
      "course_title": "Cost Management",
      "credits": "3.00",
      "description": "This course builds upon the management accounting foundation presented in MBA 510. Competitive strategy is linked with the following managerial topics: activity based costing, the theory of constraints, strategic decision making, management and operational control, cost estimation, budgeting, and cost allocation. This course is intended for those who will use accounting information within their own organization. 3. 000 Credit Hours 3. 000 Lecture hours Levels: Graduate Doctoral, Graduate Business, Graduate, Law, Undergraduate Schedule Types: Lecture Stuart School of Business College Business Administration Department",
      "institution": "Illinois Institute of Technology"
    }
  ],
  "timestamp": "2025-08-10T06:08:33.438540"
}