{
  "search_query": {
    "institution": "Kapiolani Community College",
    "successful_variation": "Kapiolani Community College",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Kapiolani+Community+College&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ACC 101",
      "course_title": "Money Metrics",
      "credits": "3.00",
      "description": "3 hours lecture per week Prerequisite(s): Credit or concurrent enrollment in ENG 22 or higher level English course, or qualification for ENG 00; qualification for MATH 24 or higher level mathematics course; ITS 02 (or ITS 0or ICS 0). ITS 02 may be taken concurrently. ITS 0or ICS 0may not be taken concurrently. ACC 101 is an introduction to accounting from a user's perspective. What is the role of accounting in the business How is accounting done How can accounting information and accountants help businesses to operate more smoothly and profitably Learn how to read financial statements, discover other sources of accounting information, and analyze a company's financial performance and financial position. Utilize internal accounting information, budgets and analytical tools such as cost-volume-profit analysis to assist in management decision-making. Explore relationships between nonfinancial metrics and profit.Upon successful completion of ACC 101, the student should be able to: Work effectively in teams. Manage projects. Demonstrate presentation capabilities using whiteboard, flip chart, power point, and/or web page presentations. List the most important characteristics of various forms of business organizations. Describe the role of accounting in the conduct of business. List and define the important accounting standards setting organizations and locate web resources for those standards. Define and list examples of types of accounts. Prepare an Income Statement, Equity Statement, and a Balance Sheet. Describe the various approaches to financing a business and how these approaches are reflected on financial statements. Compare and contrast the cash basis and accrual basis of accounting. Describe the steps in the accounting cycle. Use an integrated accounting software package to record basic business transactions and generate common financial reports. Discuss current balance sheet valuation and income measurement issues. Prepare the operating activities section of a Statement of Cash Flows. Discuss the uses of the Statement of Cash Flows. Use ratios to analyze the financial performance and financial position of a company. Discuss common non-financial metrics and show how they may be used in connection with financial metrics to evaluate a company's performance. Discuss the uses of management accounting information. Classify service and retail as to their behavior. Describe the flow of costs in a service or retail. Prepare a contribution (Cost-Volume-Profit) income statement. Predict breakeven point and profits using Cost-Volume-Profit (CVP) analysis. Discuss capital budgeting and describe different approaches to the capital budgeting process. Discuss operating budgets and describe different approaches in preparing an operating budget. Evaluate the performance of a business segment using financial and non-financial measurement techniques.",
      "institution": "Kapiolani Community College"
    },
    {
      "course_id": "ACC 132",
      "course_title": "Payroll and Hawai'i General Excise Taxes",
      "credits": "3.00",
      "description": "3 hours lecture per week Recommended Preparation: ICS 00 or ICS 0; ACC 201. ACC 132 provides training in the maintenance of payroll tax reporting systems and compliance with federal and State of Hawai'i payroll (and selected employment) laws. Students gain experience in input, processing, and reporting of payroll tax-related transactions and events within the context of both manual and computerized payroll systems. This course will also cover accounting for and reporting of Hawai'i General Excise and Use taxes. The course contents of ACC 132 prepare students for the payroll certification examinations offered by the American Payroll Association, such as Fundamental Payroll Certification (FPC) and/or Certified Payroll Professional (CPP). This course is designed as a recommended course for certain advanced ACC courses, but also serves those students seeking immediate employment as payroll clerks. Upon successful completion of ACC 132, the student should be able to: Maintain both manual and computerized payroll systems and related personnel records. Compute gross pay, withholdings, net pay, and employer taxes in a manual payroll system. Maintain general and subsidiary records of all payroll amounts in a manual payroll system and generate related journal entries. Interpret reports and generate journal entries within the framework of a computerized payroll system (e.g. payroll service bureau). Select, maintain, operate and backup a computerized payroll system. Compute required periodic payroll tax deposits/payments. Prepare required monthly, quarterly, and annual payroll tax returns for federal and Hawai'i state payroll taxes: Federal forms 940, 941, W-2, W-3; State of Hawai'i forms HW3, HW-14, UCBP-6. Reconcile paychecks, computerized payroll records, payroll tax returns, and payroll tax deposits/payments. Issue corrected paychecks and generate related journal entries; input corrections to computerized payroll records; prepare amended payroll tax returns; generate adjusting disbursements for payroll tax deposits/payments. Compute Temporary Disability Insurance premiums. Estimate workman's compensation insurance premiums for various classes of workers and in total. Discuss important employer non-financial reporting requirements Perform certain human resource functions and responsibilities related to hiring, management, employee development and termination. Monitor a company's compliance with applicable federal and State of Hawai'i payroll tax and selected employment laws. Capture relevant data, account for, and properly report Hawai'i General Excise and Use taxes.",
      "institution": "Kapiolani Community College"
    },
    {
      "course_id": "ACC 134",
      "course_title": "Individual Income Taxes",
      "credits": "3.00",
      "description": "3 hours lecture per week Recommended Preparation: ICS 00 or ICS 0. ACC 134 prepares paraprofessional accountants who are assisting an accounting professional in the preparation of the annual tax return of an individual. The course content includes the Federal and Hawai'i income tax systems and basic concepts of taxation for individuals. Students gain experience in the use of tax preparation software and tax research tools and methodologies. Upon successful completion of the course, the student should be able to: Explain basic income tax concepts and the U.S. and Hawai'i tax codes as they relate to individuals. Explain the basic principles of income recognition. Properly categorize common items as included or excluded from Gross Income. Explain the basic principles of deductions and credits. Properly categorize items as deductible \"for\" or \"from\" Adjusted Gross Incom Discuss selected special topics, including limitations on deductible losses, application of capital gains rates, etc. Prepare moderately complex U.S. and Hawai'i income tax returns for individuals both manually and by using commercial tax preparation software, such as TurboTax . Apply specific principles of tax law(s) to the recognition of income, deductions, credits, etc. Perform basic research functions using IRS publications as well as software \"Help\" menus, library, Internet and CD-ROM tax research tools. Prepare and present basic research projects involving individual income tax issues.",
      "institution": "Kapiolani Community College"
    },
    {
      "course_id": "ACC 137",
      "course_title": "Business Income Taxes",
      "credits": "3.00",
      "description": "3 hours lecture per week Recommended Preparation: ICS 00 or ICS 0; ACC 34; ACC 20; ACC 202. Comment: ACC 37 was formerly ACC 33. ACC 137 prepares students to be paraprofessional accountants assisting an accounting professional in the preparation of the annual tax return of a business. The course covers the Federal and Hawai'i tax systems and basic concepts of the taxation of business entities. Students are also introduced to tax preparation software, tax research tools and methodologies, and the distinction between GAAP and income tax bases of accounting. Upon successful completion of the course, the student should be able to: Explain basic business income tax concepts. Explain the characteristics of the various forms of business entity and their tax implications. Explain the income tax treatment of each of the following business entities: Proprietorship (Schedule C), C corporation, S corporation, Partnership, Limited Liability Company (LLC). Prepare basic income tax returns for the above businesses entities manually and by using commercial tax preparation software, such as TurboTax or similar program. Apply the proper tax treatment to elements of business income, expense, credits and special items at a basic level. Explain the major differences between \"tax\" and \"book\" income Perform basic business tax research using IRS publications as well as software \"help\" menus, library and the Internet. Prepare and present basic research projects involving business income tax issues.",
      "institution": "Kapiolani Community College"
    },
    {
      "course_id": "ACC 150",
      "course_title": "QuickBooks for Hawai'i Businesses",
      "credits": "3.00",
      "description": "3 hours lecture per week Recommended Preparation: ICS 00 or ICS 0; ACC201. Comment: Students are expected to provide their own USB compatible high density electronic storage media of minimum size specified by instructor. ACC 150 introduces popular entry-level accounting software, QuickBooks Pro . Students gain expertise in the use of QuickBooks Pro within the framework of an accounting information system. Accounting, business and computer knowledge are reinforced through application of this software tool to case studies and team projects. The course content of ACC 150 prepares students for the QuickBooks Certification Examination. Upon successful completion of the course, the student should be able to: Use QuickBooks Pro to administer the sales and collections cycle and generate related reports. Use QuickBooks Pro to administer the purchases and payments cycle and generate related reports. Use QuickBooks Pro to administer the payroll function and generate related reports. Use QuickBooks Pro to administer the inventory control function and generate related reports. Use QuickBooks Pro to administer job cost accounting system and generate related reports. Perform month-end and year-end procedures in QuickBooks Pro . Import and export data using QuickBooks Pro . Work as a team member to perform research and present results using presentation software such as PowerPoint .",
      "institution": "Kapiolani Community College"
    },
    {
      "course_id": "ACC 155",
      "course_title": "Excel for Businesses",
      "credits": "3.00",
      "description": "3 hours lecture per week Prerequisite(s): Credit or concurrent enrollment in ICS 00 or ICS 01. Recommended Preparation: ACC 202. Comment: Students are expected to provide their own USB compatible high density electronic storage media of minimum size specified by instructor. ACC 155 emphasizes the use of spreadsheets and databases as a tool for making business decisions. Students gain not only technical expertise and advanced spreadsheet skills, but also operating proficiency in the use of Microsoft Excel within the framework of a business information system. Basic Access will be introduced to students as an alternate tool to deal with data intensive situations. Accounting, business and computer knowledge are reinforced through application of these software tools to model building, trouble shooting, case studies, and team projects. Upon successful completion of the course, the student should be able to: Use Excel to prepare common accounting workpapers, including various supporting schedules, loan amortization schedules, payroll reconciliation, book-to-tax conversion, etc. Design an Excel worksheet template needed for solution of a business question such as those related to cost-volume-profit planning, capital budgeting, and incremental analysis. Use selected advanced Excel Data features. Use DDE and OLE features as they relate to other Microsoft programs such as Access . Record and debug basic macros Assign macros to buttons to create customized menus. Modify recorded macros using VBA (Visual Basic for Applications), Use selected other advanced Excel tools. Import data from QuickBooks or other integrated general ledger systems. Use Access to create and maintain databases to track accounting and business data. Investigate single-purpose utility programs (e.g. cash flow forecast and fixed asset modules/software) as alternatives to Excel . Create/Read documents using Adobe Acrobat Reader/Writer or similar software. Work as a team member to perform research and present results using presentation software such as PowerPoint .",
      "institution": "Kapiolani Community College"
    },
    {
      "course_id": "ACC 193V",
      "course_title": "Cooperative Education",
      "credits": "4.00",
      "description": "1hour seminar, 3 hours work experience per week for one credit. Prerequisite(s): ACC 201. Recommended Preparation: Student should be in third or fourth semester of work toward the Accounting AS degree or have permission of the instructor. ACC 193V is a Cooperative Program between the employer and the college that integrates classroom learning with supervised practical experience. Upon successful completion of ACC 193V, the student should be able to: Perform activities in the cooperative work area involving such areas as routine tasks, problem or crisis situations, creative suggestions or initiatives, personal development, work attitudes and other competencies as determined by the instructor. Write an essay on overall competency, such as analyzing or describing the student's job in terms of the organization and its relationship to principles, concepts or procedures covered in the field of study.",
      "institution": "Kapiolani Community College"
    },
    {
      "course_id": "ACC 201",
      "course_title": "Introduction to Financial Accounting",
      "credits": "3.00",
      "description": "3 hours lecture per week Recommended Preparation: ICS 00 or ICS 0; qualification for MATH 24 or higher; ENG 22 or higher. ACC 201 is an introduction to accounting theory and procedure. Students learn how to record, report, and analyze financial information for sole proprietorships and partnerships. Upon successful completion of ACC 201, the student should be able to: Explain the purpose and give examples of the uses of basic financial statements of a business entity. Define assets, liabilities, and owner's equity, and discuss the relationship of the accounting equation to the process of recording business transactions. Explain the purpose of the journal, ledger, and trial balance and show how they are used in the recording process to facilitate the compiling and accumulation of accounting information. Record transactions for service and merchandising businesses in special journals and the general journal. Explain the purpose of adjusting and closing entries, proficiently prepare adjusting and closing entries. Explain the basic steps of the accounting cycle. Prepare and explain the basic elements of the Income Statement, Statement of Owner's Equity, and the Balance Sheet for a service or a merchandising business. Explain \"Internal Control\" as a function of Accounting and indicate the basic principles involved in establishing controls to safeguard assets and enhance the accuracy and reliability of accounting records. Describe the nature of special journals and subsidiary ledgers, proficiently execute manual recording procedures, and fully explain how computerization affects such procedures. List the basic procedures necessary for effective accounting and control of cash transactions; correctly preparing bank reconciliations; and establishing and maintaining petty cash funds. Record and control transactions involving credit sales and purchases, including the procedures for recording uncollectible accounts. Describe promissory notes and account for such notes, including the computation of interest. Calculate, accurately record, and report basic inventory transactions using the periodic and perpetual methods. Accurately determine inventory value using the lower of cost or market, gross profit, retail, and cost methods including pricing at FIFO, Average and LIFO. List the purpose and accounting principles underlying the use of depreciation, its recording and reporting; and calculate depreciation using straight line, units of production, and accelerated methods. Determine \"cost\" of plant, property, and equipment; differentiate between capital and revenue expenditures; and prepare entries to record typical transactions and events, including disposals. List the major components and procedures involved in the maintenance of payroll records and account for payrolls and payroll taxes. Explain generally accepted accounting principles and the various principles which should be observed to assure \"reliability, understandability, and comparability\" of financial reports. Determine amounts and record transactions affecting partnerships, including formation, distribution of profits and losses, changes in membership, and liquidation, and prepare Statements of Partners' Equities.",
      "institution": "Kapiolani Community College"
    },
    {
      "course_id": "ACC 202",
      "course_title": "Introduction to Managerial Accounting",
      "credits": "3.00",
      "description": "3 hours lecture per week Prerequisite(s): ACC 20or both ACC 24 and ACC 25. Recommended Preparation: ICS 00 or ICS 0. ACC 202 introduces students to accounting for corporations and an introduction to methods for evaluating financial performance, including cost accounting, budgeting, break-even analysis, ratio analysis, and sources and uses of cash. Upon successful completion of ACC 202, the student should be able to: List, define, and indicate the application of basic accounting principles and concepts and their application to accounting procedures and financial reporting requirements. Recognize the differences in the nature of proprietorships, partnerships and corporations and relate such differences in the accounting for and reporting of owners' equities. List, define, and indicate the application of the flow of production costs and record rudimentary transactions involved in manufacturing operations. Prepare financial statements (basic and special) and use analytical techniques used in the analysis and interpretation of financial reports for decision-making purposes. Discuss principles of budgetary control and prepare special budget reports used in the administration of budget-based accounting systems. Utilize the Internet and email as research and communications tools. Effectively communicate accounting information and reports orally and in writing. Determine amounts and record transactions involving corporate organization, issuance, subscription and purchase of the various classes of capital stock, declaration and distributions of dividends, accumulation and restriction of retained earnings. Prepare the stockholders' equity section of the Balance Sheet, the Statement of Retained Earnings and the Income Statement, including presentation of extraordinary and unusual gains and losses, prior period adjustments, and earnings per share. Describe the nature of bonds and record transactions involving bonds including issuance, redemption, interest and amortization of discount and premium, bond sinking funds, and other long-term liabilities, and indicate their balance sheet presentation. Record transactions involving long and short-term investments and show their balance sheet presentation. Analyze cash flows at an introductory level and prepare a Statement of Cash Flows using the indirect method. Analyze and interpret information contained in corporate financial statements from the viewpoint of creditors and investors. List and define examples of production processes, types of and flow of manufacturing costs. Prepare journal entries to record manufacturing costs. Compute product costs and the value inventories for manufacturing operations under job order costing. Compute product costs and the value inventories for manufacturing operations under process costing. Discuss principles used in budgetary systems and prepare basic analytical reports used in administration of those systems. List, define, and indicate the application of the use of standard costing in budgets as instruments of planning and control. Compute basic material and labor cost variances in a standard cost accounting system. Compute basic overhead cost variances in a standard cost accounting system. Discuss capital budgeting techniques, such as cash payback period, discounted cash flow, net present value, and internal rate of return, and indicate their usefulness in managerial decision-making. Discuss other aids in the managerial decision-making process, including incremental cost-benefit analysis.",
      "institution": "Kapiolani Community College"
    },
    {
      "course_id": "ACC 205",
      "course_title": "Cost Accounting",
      "credits": "3.00",
      "description": "3 hours lecture per week Prerequisite(s): ACC 2or ACC 202. ACC 205 is an introduction to the principles and procedures of cost accounting, including a study of job order and process cost systems, manufacturing cost controls and variance analysis. Upon successful completion of ACC 205, the student should be able to: Demonstrate understanding of manufacturing operations and describe procurement, costing and control procedures for the three elements of production costs (materials, labor and overhead). Record the flow of costs through the cost records and accounts; and compute costs under job order, process and standard costing. Describe the importance and use of cost accounting data in planning, control and management decision making. Classify and record production costs, prepare general journal entries and manufacturing statements. Describe the steps in materials purchasing and issuing procedures, together with their supporting documents and records necessary for accounting and control. Describe the physical inventorying procedures and the accounting methods; prepare general journal entries, maintain stock cards at LIFO, FIFO, and average cost and apply the lower-of-cost-or-market rule. Discuss procedures and records for accumulating and accounting for labor costs. Demonstrate introductory level skills for classifying, recording, summarizing, and allocating manufacturing overhead costs. Discuss and apply accounting techniques for recording losses from scrap, spoilage, and defective goods. Maintain job cost ledger sheets; compute cost of finished products; determine the value of work-in-process and finished goods inventory. Compute unit cost of production and value of inventories under the process costing method and to prepare production cost reports. Discuss the techniques for assignment of common production costs to joint products. Determine fixed, variable, and other cost classification; compute basic variances under standard costing and discuss their importance in planning and control activities. Describe budgeting procedures and be able to prepare sales, production, manufacturing costs, and operating budgets.",
      "institution": "Kapiolani Community College"
    }
  ],
  "timestamp": "2025-08-10T09:55:31.018690"
}