{
  "search_query": {
    "institution": "Michigan State University",
    "successful_variation": "Michigan State University",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Michigan+State+University&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ABM 100",
      "course_title": "Decision -making in the Agri-Food System",
      "credits": "3.00",
      "description": "Semester: Fall of every year, Spring of every year Credits:Total Credits: 3 Lecture/Recitation/Discussion Hours: 3 3(3-0) Description: Organization and operation of the agri-food system. Economic analysis of agri-food firms and consumers. Management functions and decision-making of agri-food firms. Semester Alias: FSM 200 Interdepartmental With: Food Industry Management Administered By: Agribusiness Management Effective Dates: FALL 2000 - Open",
      "institution": "Michigan State University"
    },
    {
      "course_id": "ABM 130",
      "course_title": "Farm Management I",
      "credits": "3.00",
      "description": "Semester: Fall of every year Credits:Total Credits: 3 Lecture/Recitation/Discussion Hours: 3 3(3-0) Description: General farm management including record keeping, income tax management, farm finance, and operational management of agricultural resources. Semester Alias: AEC 050 Effective Dates: SPRING 2002 - Open View all versions of this course",
      "institution": "Michigan State University"
    },
    {
      "course_id": "ABM 210",
      "course_title": "Professional Seminar in Agribusiness Management",
      "credits": "1.00",
      "description": "Semester: Spring of every year Credits:Total Credits: 1 Lecture/Recitation/Discussion Hours: 1 1(1-0) Restrictions: Open only to students in the Agribusiness Management Specialization. Open only to students in the Agribusiness Management, Animal Science, Crop and Soil Science, and Horticulture majors. Description: Industry trends in agribusiness management. Verbal, written, and visual communication techniques applied to professional situations, including professional development and career planning. Effective Dates: FALL 2005 - Open View all versions of this course",
      "institution": "Michigan State University"
    },
    {
      "course_id": "ABM 222",
      "course_title": "Agribusiness and Food Industry Sales",
      "credits": "3.00",
      "description": "Semester: Fall of every year, Spring of every year Credits:Total Credits: 3 Lecture/Recitation/Discussion Hours: 3 3(3-0) Prerequisite: (ABM 100 or ABM 130 or EC 201 or EC 202) and completion of Tier I writing requirement Restrictions: Open only to sophomores or juniors or seniors. Description: Selling processes and activities within agribusiness and food firms. Principles and techniques of sales. Operation of sales organizations. Semester Alias: FSM 320 Interdepartmental With: Food Industry Management Administered By: Agribusiness Management Effective Dates: FALL 2000 - Open View all versions of this course",
      "institution": "Michigan State University"
    },
    {
      "course_id": "ABM 224",
      "course_title": "Information and Market Intelligence in the Agri-Food Industry",
      "credits": "3.00",
      "description": "Semester: Fall of every year Credits:Total Credits: 3 Lecture/Recitation/Discussion Hours: 3 3(3-0) Prerequisite: (ABM 100 or concurrently) or (EC 201 or concurrently) Description: Researching agri-food issues, food industry business environments, and agri-food industry trends. Information gathering. Electronic library reference sources. Synthesis of data and information into market intelligence. Semester Alias: FIM 424 Interdepartmental With: Food Industry Management Administered By: Food Industry Management Effective Dates: FALL 2008 - Open View all versions of this course",
      "institution": "Michigan State University"
    },
    {
      "course_id": "ABM 225",
      "course_title": "Commodity Marketing I",
      "credits": "3.00",
      "description": "Semester: Fall of every year Credits:Total Credits: 3 Lecture/Recitation/Discussion Hours: 3 3(3-0) Prerequisite: ABM 100 or EC 201 Description: Commodity markets in the agri-food system. Analysis of supply, demand, and pricing alternatives. Agri-food marketing processes, including marketing cooperatives. Effective Dates: FALL 2005 - Open View all versions of this course",
      "institution": "Michigan State University"
    },
    {
      "course_id": "ABM 332",
      "course_title": "Agribusiness Operations Management",
      "credits": "3.00",
      "description": "Semester: Fall of every year Credits:Total Credits: 3 Lecture/Recitation/Discussion Hours: 3 3(3-0) Prerequisite: ABM 100 Description: The operational and tactical decisions of producers, wholesalers, retailers and service-related firms in agribusiness. Information systems usage. Analytical decision-making tools and techniques. Effective Dates: FALL 2003 - Open View all versions of this course",
      "institution": "Michigan State University"
    },
    {
      "course_id": "ABM 337",
      "course_title": "Labor and Personnel Management in the Agri-Food System",
      "credits": "3.00",
      "description": "Semester: Fall of every year Credits:Total Credits: 3 Lecture/Recitation/Discussion Hours: 3 3(3-0) Prerequisite: ABM 100 or ABM 130 or HRT 404 Restrictions: Open only to juniors or seniors. Description: Human resource management practices and techniques for farms, and agri-food firms: planning, recruiting, training, motivating, and evaluating. Labor regulations, compensation incentive plans, and employee benefits. Semester Alias: FSM 325 Effective Dates: FALL 2005 - Open View all versions of this course",
      "institution": "Michigan State University"
    },
    {
      "course_id": "ABM 400",
      "course_title": "Public Policy Issues in the Agri-Food System",
      "credits": "3.00",
      "description": "Semester: Spring of every year Credits:Total Credits: 3 Lecture/Recitation/Discussion Hours: 3 3(3-0) Prerequisite: ABM 100 Restrictions: Open only to juniors or seniors. Description: Objectives, alternatives and consequences of public policy in the agri-food system. Analysis of economic implications for food and agribusiness firms, farmers, consumers and society. Semester Alias: FSM 421 Interdepartmental With: Food Industry Management Administered By: Agribusiness Management Effective Dates: SPRING 2002 - Open View all versions of this course",
      "institution": "Michigan State University"
    },
    {
      "course_id": "ABM 405",
      "course_title": "Corporate Environmental Management",
      "credits": "3.00",
      "description": "Semester: Fall of every year Credits:Total Credits: 3 Lecture/Recitation/Discussion Hours: 3 3(3-0) Prerequisite: EEP 255 or ABM 332 or MGT 315 or MGT 325 Description: Integration of environmental protection and pollution prevention with business management. Economic and strategic analysis of environmental protection. Semester Alias: PRM 405 Interdepartmental With: Environmental Economics and Policy Administered By: Environmental Economics and Policy Effective Dates: FALL 2002 - Open View all versions of this course",
      "institution": "Michigan State University"
    }
  ],
  "timestamp": "2025-08-10T17:07:39.073109"
}