{
  "search_query": {
    "institution": "Nazareth College",
    "successful_variation": "Nazareth College",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Nazareth+College&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ACT 209",
      "course_title": "Principles of Accounting I",
      "credits": "3.00",
      "description": "An introduction to the principles and practices of accounting as applied to sole proprietorships in both service and merchandising industries. The course covers adjusting and closing entries, preparation and introductory analysis of financial statements, accounting for inventory, cash and receivables. Prerequisites & Notes Adv Codes: AB Credits: 3",
      "institution": "Nazareth College"
    },
    {
      "course_id": "ACT 210",
      "course_title": "Principles of Accounting II",
      "credits": "3.00",
      "description": "Students will continue their study of accounting principles and procedures in more complex financial situations. The course covers fixed assets, liabilities, investments, partnerships and corporations. Prerequisites & Notes Adv Codes: AB Prereq: ACT 209 Credits: 3",
      "institution": "Nazareth College"
    },
    {
      "course_id": "ACT 264",
      "course_title": "Managerial Uses of Accounting Information",
      "credits": "3.00",
      "description": "Students will be introduced to cost accounting concepts and to ways management can use information generated by the accounting system as an aid in decision-making. Prerequisites & Notes Adv Codes: B Prereq: ACT 209 Credits: 3",
      "institution": "Nazareth College"
    },
    {
      "course_id": "ACT 341",
      "course_title": "Federal Income Tax Accounting",
      "credits": "3.00",
      "description": "The study of federal income tax as it relates to individuals and small business concerns. Prerequisites & Notes Prereq: ACT 209 Credits: 3",
      "institution": "Nazareth College"
    },
    {
      "course_id": "ACT 342",
      "course_title": "Corporate Tax Accounting",
      "credits": "3.00",
      "description": "A survey of federal income tax as it relates to corporations and partnerships. Prerequisites & Notes Adv Codes: AC Prereq: ACT 341 Credits: 3",
      "institution": "Nazareth College"
    },
    {
      "course_id": "ACT 343",
      "course_title": "Cost Accounting",
      "credits": "3.00",
      "description": "This course concentrates on internal accounting for primarily manufacturing-type businesses. Topics include cost analysis, job-order costing, process costing, variance analysis, budgeting and capital budgeting. Prerequisites & Notes Adv Codes: AC Prereq: ACT 209 Credits: 3",
      "institution": "Nazareth College"
    },
    {
      "course_id": "ACT 345",
      "course_title": "Intermediate Accounting I",
      "credits": "3.00",
      "description": "Students will explore topics of intermediate financial accounting and learn how to analyze and report more complex events. After reviewing financial statements, topics will include an in-depth look at cash, receivables, inventory and fixed assets. Prerequisites & Notes Prereq: ACT 210 and a C or better in ACT 210 Credits: 3",
      "institution": "Nazareth College"
    },
    {
      "course_id": "ACT 346",
      "course_title": "Intermediate Accounting II",
      "credits": "3.00",
      "description": "A continuation of the progression into the intermediate level of financial accounting concepts. Topics of study include depreciation, intangibles, liabilities, equity and investments. Prerequisites & Notes Adv Codes: A Prereq: ACT 345 and a C or better in ACT 345 Credits: 3",
      "institution": "Nazareth College"
    },
    {
      "course_id": "ACT 349",
      "course_title": "Corporate Finance",
      "credits": "3.00",
      "description": "An analysis of the organizational and financial structures and problems of the modern business corporation. Prerequisites & Notes Adv Codes: AB Prereq: ACT 209 Credits: 3",
      "institution": "Nazareth College"
    },
    {
      "course_id": "ACT 350",
      "course_title": "Not-For-Profit Acct",
      "credits": "3.00",
      "description": "The course is an introduction to the principles and practices of accounting for government and not-for-profit organizations. Students will examine the fund accounting principles and issues important to firms operating within the non-profit areas of education, health and welfare, churches and other not-for-profit situations. Prerequisites & Notes Prereq: ACT 210 Credits: 3",
      "institution": "Nazareth College"
    }
  ],
  "timestamp": "2025-08-10T14:30:08.143187"
}