{
  "search_query": {
    "institution": "Randolph Community College",
    "successful_variation": "Randolph Community College",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Randolph+Community+College&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ACA 115",
      "course_title": "Success & Study Skills",
      "credits": "3.00",
      "description": "This course provides an orientation to the campus resources and academic skills necessary to achieve educational objectives. Emphasis is placed on an exploration of facilities and services, study skills, library skills, self-assessment, wellness, goal-setting, and critical thinking. Upon completion, students should be able to manage their learning experiences to successfully meet educational goals.",
      "institution": "Randolph Community College"
    },
    {
      "course_id": "ACC 120",
      "course_title": "Prin of Financial Acct",
      "credits": "3.00",
      "description": "This course introduces business decision-making accounting information systems. Emphasis is placed on analyzing, summarizing, reporting, and interpreting financial information. Upon completion, students should be able to prepare financial statements, understand the role of financial information in decision?making and address ethical considerations. This course has been approved to satisfy the Comprehensive Articulation Agreement pre-major and/or elective course requirement.",
      "institution": "Randolph Community College"
    },
    {
      "course_id": "ACC 121",
      "course_title": "Prin of Managerial Acct",
      "credits": "3.00",
      "description": "This course includes a greater emphasis on managerial and cost accounting skills. Emphasis is placed on managerial accounting concepts for external and internal analysis, reporting and decision-making. Upon completion, students should be able to analyze and interpret transactions relating to managerial concepts including product-costing systems. This course has been approved to satisfy the Comprehensive Articulation Agreement pre-major and/or elective course requirement. Prerequisite: ACC 120.",
      "institution": "Randolph Community College"
    },
    {
      "course_id": "ACC 131",
      "course_title": "Federal Income Taxes",
      "credits": "3.00",
      "description": "This course provides an overview of federal income taxes for individuals, partnerships, and corporations. Topics include tax law, electronic research and methodologies and the use of technology for the preparation of individual and business tax returns. Upon completion, students should be able to analyze basic tax scenarios, research applicable tax laws, and complete federal tax returns for individuals, partnerships, and corporations.",
      "institution": "Randolph Community College"
    },
    {
      "course_id": "ACC 140",
      "course_title": "Payroll Accounting",
      "credits": "3.00",
      "description": "This course covers federal and state laws pertaining to wages, payroll taxes, payroll tax forms, and journal and general ledger transactions. Emphasis is placed on computing wages; calculating social security, income, and unemployment taxes; preparing appropriate payroll tax forms; and journalizing/posting transactions. Upon completion, students should be able to analyze data, make appropriate computations, complete forms, and prepare accounting entries using appropriate technology. Prerequisites: ACC 115 or ACC 120.",
      "institution": "Randolph Community College"
    },
    {
      "course_id": "ACC 150",
      "course_title": "Acct Software Appl",
      "credits": "3.00",
      "description": "This course introduces microcomputer applications related to accounting systems. Topics include general ledger, accounts receivable, accounts payable, inventory, payroll, and correcting, adjusting, and closing entries. Upon completion, students should be able to use a computer accounting package to solve accounting problems. Prerequisites: ACC 115 or ACC 120.",
      "institution": "Randolph Community College"
    },
    {
      "course_id": "ACC 152",
      "course_title": "Adv Software Appl",
      "credits": "3.00",
      "description": "This course provides continued exposure to commercial accounting software and the opportunity to refine skills developed in ACC 150. Emphasis is placed on advanced applications of software packages. Upon completion, students should be able to use commercial software to complete complex accounting tasks. Prerequisite: ACC 150.",
      "institution": "Randolph Community College"
    },
    {
      "course_id": "ACC 220",
      "course_title": "Intermediate Accounting I",
      "credits": "3.00",
      "description": "This course is a continuation of the study of accounting principles with in-depth coverage of theoretical concepts and financial statements. Topics include generally accepted accounting principles and an extensive analyses of financial statements. Upon completion, students should be able to demonstrate competence in the conceptual framework underlying financial accounting, including the application of financial standards. Prerequisite: ACC 120.",
      "institution": "Randolph Community College"
    },
    {
      "course_id": "ACC 221",
      "course_title": "Intermediate Acct II",
      "credits": "3.00",
      "description": "This course is a continuation of ACC 220. Emphasis is placed on special problems which may include leases, bonds, investments, ratio analyses, present value applications, accounting changes, and corrections. Upon completion, students should be able to demonstrate an understanding of the principles involved and display an analytical problem-solving ability for the topics covered. Prerequisite: ACC 220.",
      "institution": "Randolph Community College"
    },
    {
      "course_id": "AHR 120",
      "course_title": "HVACR Maintenance",
      "credits": "3.00",
      "description": "This course introduces the basic principles of industrial air conditioning and heating systems. Emphasis is placed on preventive maintenance procedures for heating and cooling equipment and related components. Upon completion, students should be able to perform routine preventive maintenance tasks, maintain records, and assist in routine equipment repairs.",
      "institution": "Randolph Community College"
    }
  ],
  "timestamp": "2025-08-10T23:50:18.432947"
}