{
  "search_query": {
    "institution": "Sam Houston State University",
    "successful_variation": "Sam Houston State University",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Sam+Houston+State+University&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ACC 231",
      "course_title": "Principles of Financial Accounting",
      "credits": "3.00",
      "description": "A study of the basic accounting concepts and procedures underlying the organization and reporting of financial information. Topics include the accounting cycle, the preparation of financial statements, the measurement and reporting of business income, and the valuation and presentation of assets and current liabilities. Emphasis is placed on the relevance of the business and economic information generated by the accounting process and how it is used in personal and business decision making. Prerequisite: 18 semester credit hours of college credit. Students who plan to take ACC 365  must earn a minimum grade of C in ACC 231 . Credit 3.",
      "institution": "Sam Houston State University"
    },
    {
      "course_id": "ACC 232",
      "course_title": "Principles of Managerial Accounting",
      "credits": "3.00",
      "description": "A continuation of financial accounting topics followed by an introduction to managerial accounting. Topics include corporate accounting issues, bonds, statement of cash flows, financial statement analysis, job costing, cost behavior, cost-volume-profit analysis, budgeting, performance evaluation, product pricing and capital budgeting. Emphasis is placed on the usage of accounting information in managerial decision making. Prerequisite: ACC 231 . Students who plan to take ACC 365  must earn a minimum grade of C in ACC 232 . Credit 3.",
      "institution": "Sam Houston State University"
    },
    {
      "course_id": "ACC 331",
      "course_title": "Managerial Accounting",
      "credits": "3.00",
      "description": "Further development of financial accounting concepts, interpretation, and the study of management uses of accounting data. This course includes a study of basic accounting concepts, interpretation of accounting reports, cost control and analysis, and methods of measuring performance. Not open to Accounting majors or minors. Prerequisite: ACC 232 . Credit 3.",
      "institution": "Sam Houston State University"
    },
    {
      "course_id": "ACC 335",
      "course_title": "International Accounting",
      "credits": "3.00",
      "description": "An introduction to the accounting aspects of international business. Topics covered from an international perspective include the interaction between accounting and its environment, differing national accounting practices, international harmonization of accounting and reporting, foreign currency translation and exchange rate issues, problems of inflation, transfer pricing and taxation, managerial accounting and analysis of foreign financial statements. Prerequisite: ACC 232 . Credit 3.",
      "institution": "Sam Houston State University"
    },
    {
      "course_id": "ACC 365",
      "course_title": "Intermediate Accounting I",
      "credits": "3.00",
      "description": "A thorough study of the accounting principles underlying the preparation of financial statements. This course is concerned primarily with the recording process, formats of the financial statements, and the measurement and reporting of current and non-current assets and related revenues and expenses. The environment of accounting, basic accounting theory, and time value of money concepts are emphasized. Prerequisite: ACC 231  and ACC 232  with a minimum grade of C in each. Credit 3.",
      "institution": "Sam Houston State University"
    },
    {
      "course_id": "ACC 366",
      "course_title": "Intermediate Accounting II",
      "credits": "3.00",
      "description": "A continuation of ACC 365 , this course extends the study of the preparation of financial statements to the measurement and reporting of current and long term liabilities, stockholders’ equity and investments. Additional topics include cash flow statements, accounting for pensions, leases, and income taxes. Prerequisite: ACC 365  with a minimum grade of C. Credit 3.",
      "institution": "Sam Houston State University"
    },
    {
      "course_id": "ACC 369",
      "course_title": "Cost Accounting",
      "credits": "3.00",
      "description": "A study of cost accounting principles and techniques of assembling data for product costing and for managerial use in planning and control and decision making. Cost terminology, cost behavior, job order and process costing, budgeting, cost-volume-profit analysis, standard costs, and activity based costing are topics covered. Prerequisite: ACC 231  and ACC 232  with a minimum grade of C in each. Credit 3.",
      "institution": "Sam Houston State University"
    },
    {
      "course_id": "ACC 381",
      "course_title": "Principles of Accounting Systems Designs",
      "credits": "3.00",
      "description": "A study of principles of accounting systems design integrated into both manual and computerized systems. Also includes emphasis on the accounting cycle, internal control structures, computerized transaction processing systems, relational databases, and integrated enterprise resource planning systems in accounting. Prerequisites: ACC 231  and ACC 232 . Credit 3.",
      "institution": "Sam Houston State University"
    },
    {
      "course_id": "ACC 383",
      "course_title": "Income Tax Accounting",
      "credits": "3.00",
      "description": "A study of basic tax concepts and income taxation of individuals. Emphasis is placed on the determination of income and statutory deductions in order to arrive at the net taxable income. Consideration is given to tax planning as well as decision-making and tax return problems. Prerequisite: ACC 231  and ACC 232  with a minimum grade of C in each. Credit 3.",
      "institution": "Sam Houston State University"
    },
    {
      "course_id": "ACC 430",
      "course_title": "Studies In Accounting",
      "credits": "3.00",
      "description": "Individual study as arranged with members of the faculty. This course may be repeated and may be taken for Academic Distinction Program Credit. Prerequisite: Consent of Department Chair. Credit 1, 2, or 3.",
      "institution": "Sam Houston State University"
    }
  ],
  "timestamp": "2025-08-10T04:00:37.824191"
}