{
  "search_query": {
    "institution": "Shippensburg University of Pennsylvania",
    "successful_variation": "Shippensburg University of Pennsylvania",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Shippensburg+University+of+Pennsylvania&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ACCT 200",
      "course_title": "Fundamentals of Financial Accounting",
      "credits": "3.00",
      "description": "Introduces accounting concepts, principles, and practices followed in the preparation of external financial reports. Alternative accounting treatments and policies relative to asset valuation, liability measurement, and income determination are discussed. Emphasis on interpretation, uses, and limitations of financial reports. Prerequisite: ECON 101 (Grade of C or Higher), ECON 102 (Grade of C or Higher), ECON 113 (Grade of C or Higher), HONR 165 (Grade of C or Higher), or HONR 166 (Grade of C or Higher)",
      "institution": "Shippensburg University of Pennsylvania"
    },
    {
      "course_id": "ACCT 201",
      "course_title": "Managerial Accounting",
      "credits": "3.00",
      "description": "Introduces accounting concepts for planning, control, motivation, internal reporting, and evaluation. Topics included are product cost determination procedures, analysis of cost behavior, budgeting, costs for decision making and control, and responsibility accounting. Emphasis on the internal decision maker's use of information generated by the accounting system. Prerequisite: ACCT 200",
      "institution": "Shippensburg University of Pennsylvania"
    },
    {
      "course_id": "ACCT 306",
      "course_title": "Tax Accounting",
      "credits": "3.00",
      "description": "Introduces fundamentals of federal taxation as they apply to tax entities including individuals, corporations, and partnerships. Primary emphasis on taxation of individuals with some emphasis on business activities including property transactions. Other tax entities also discussed. Students introduced to tax research and tax planning. Prerequisite: ACCT 200 (Grade of C or Higher) and ACCT 201 (Grade of C or Higher)",
      "institution": "Shippensburg University of Pennsylvania"
    },
    {
      "course_id": "ACCT 310",
      "course_title": "Intermediate Accounting I",
      "credits": "3.00",
      "description": "First of three courses involving an intensive study of accounting concepts, theories, and practices relative to external financial reporting. Topics include: processing and reporting financial transactions and information relating to the content and structure of financial statements; concepts and procedures underlying revenue and expense recognition; application of time value of money concepts in an accounting framework; and valuation and accounting for current assets, long-term tangible assets, current liabilities, and long-term liabilities. Prerequisite: ACCT 200 (Grade of C or Higher) and ACCT 201 (Grade of C or Higher)",
      "institution": "Shippensburg University of Pennsylvania"
    },
    {
      "course_id": "ACCT 311",
      "course_title": "Intermediate Accounting II",
      "credits": "3.00",
      "description": "Second of three courses involving an intensive study of accounting concepts, theories and practices relative to external financial reporting. Topics include: processing and reporting financial transactions and information relating to the content and structure of financial statements; concepts and procedures underlying revenue and expense recognition; application of time value of money concepts in an accounting framework; and valuation and accounting for liabilities, stockholders' equity, investments, deferred income taxes, compensation, accounting changes, earnings per share, pension and leases. Prerequisite: ACCT 310 (Grade of C or Higher)",
      "institution": "Shippensburg University of Pennsylvania"
    },
    {
      "course_id": "ACCT 312",
      "course_title": "Cost Determination and Analysis",
      "credits": "3.00",
      "description": "Introduces the principles and procedures of cost analysis and control; theories of cost allocation and accumulation; uses of accounting information for planning, control and performance evaluation. Continues development of skills for analyzing complex cost and managerial accounting problems using microcomputer spreadsheet models. Includes process costing, cost allocation, joint costs, transfer pricing, and divisional performance evaluation, statistical applications in cost analysis and capital budgeting. Emphasis throughout on processing of cost information as well as analysis, reporting, and evaluation of the cost data. Prerequisite: ACCT 200 (Grade of C or Higher), ACCT 201 (Grade of C or Higher), and (SCMG 200 or ITMG 200)",
      "institution": "Shippensburg University of Pennsylvania"
    },
    {
      "course_id": "ACCT 399",
      "course_title": "Independent Study in Accounting",
      "credits": "3.00",
      "description": "Independent study affords students the opportunity to engage in independent study related to their major field, a supporting area, or specialized interest.",
      "institution": "Shippensburg University of Pennsylvania"
    },
    {
      "course_id": "ACCT 401",
      "course_title": "Advanced Financial Accounting",
      "credits": "3.00",
      "description": "Third of three courses involving an intensive study of accounting concepts, theories, and practices relative to external financial reporting. Topics include consolidated financial statements, accounting in the international environment, and governmental accounting. Issues relating to full disclosure and the role of the Securities and Exchange Commission and professional accounting organizations in financial reporting are considered. This class is available for graduate credit. Prerequisite: ACCT 311 (Grade of C or Higher)",
      "institution": "Shippensburg University of Pennsylvania"
    },
    {
      "course_id": "ACCT 404",
      "course_title": "Auditing",
      "credits": "3.00",
      "description": "Introduction to standards and procedures employed by professional accountants in performing audits. The objectives of an audit and the types of examinations necessary for rendering opinions on financial reports and for other specified purposes are considered. This class is available for graduate credit. Prerequisite: ACCT 311 (Grade of C or Higher)",
      "institution": "Shippensburg University of Pennsylvania"
    },
    {
      "course_id": "ACCT 406",
      "course_title": "Advanced Tax Accounting",
      "credits": "3.00",
      "description": "More in-depth coverage of impact of federal income tax on business entities including proprietors, corporations, and partnerships. Primary emphasis is taxation of corporations and flow-through tax entities. Includes expanded coverage of tax research and planning as well as ethical responsibilities in tax practice. This class is available for graduate credit. Prerequisite: ACCT 306 (Grade of C or Higher)",
      "institution": "Shippensburg University of Pennsylvania"
    }
  ],
  "timestamp": "2025-08-08T17:43:19.547341"
}