{
  "search_query": {
    "institution": "South Georgia Technical College",
    "successful_variation": "South Georgia Technical College",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=South+Georgia+Technical+College&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ACC 101",
      "course_title": "Principles of Accounting I",
      "credits": "8.00",
      "description": "Prerequisite(s): Provisional Admission Introduces the student to the basic concepts of the complete accounting cycle and provides the student with the necessary skills to maintain a set of books for sole proprietorship. Topics include: accounting vocabulary for a personal service business and merchandising enterprise, business transactions, the rules of debit and credit, journalizing and positing transactions to general and subsidiary ledgers, financial statements, adjusting and closing entries, and accounting for cash. Laboratory work demonstrates theory presented in class.",
      "institution": "South Georgia Technical College"
    },
    {
      "course_id": "ACC 102",
      "course_title": "Principles of Accounting II",
      "credits": "8.00",
      "description": "Prerequisite(s): Program Admission, ACC 101 Applies the basic principles of accounting to account classifications and subsidiary record accounting. Topics include: payroll, notes an plant assets. Laboratory work demonstrates theory presented in class.",
      "institution": "South Georgia Technical College"
    },
    {
      "course_id": "ACC 103",
      "course_title": "Principles of Accounting III",
      "credits": "8.00",
      "description": "Prerequisite(s): ACC 102 Emphasizes fundamental understanding of corporate and cost accounting. Topics include: accounting for a corporation, departmental and branch accounting, job/order process cost accounting and budgeting. Laboratory work demonstrates theory presented in class.",
      "institution": "South Georgia Technical College"
    },
    {
      "course_id": "ACC 104",
      "course_title": "Computerized Accounting",
      "credits": "5.00",
      "description": "Prerequisite(s): ACC 102, BUS 101 or CIS 101 Emphasizes operation of computerized accounting systems from manual input forms. Topics include: set up and operation or equipment, advanced payroll, general ledger, accounts receivable, accounts payable, posting, financial reports, and other topics such as inventory and depreciation for which software is available. Laboratory work includes theoretical and technical application.",
      "institution": "South Georgia Technical College"
    },
    {
      "course_id": "ACC 105",
      "course_title": "Accounting Database Fundamentals",
      "credits": "5.00",
      "description": "Prerequisite(s): ACC 101, BUS 101, BUS 104 Emphasizes use of database management software packages for programrelated database applications. Topics include: planning and designing a database; database creation; data entry; database access; manipulation, and updating; sort, index, and query functions; database program-related applications; and database management applications. Laboratory work includes theoretical and technical applications.",
      "institution": "South Georgia Technical College"
    },
    {
      "course_id": "ACC 106",
      "course_title": "Accounting Spreadsheet Fundamentals",
      "credits": "5.00",
      "description": "Prerequisite(s): ACC 101, BUS 101, BUS 104 Provides instruction in the use of electronic spreadsheet software packages for program related spreadsheet applications. Students become proficient in creation, modification, and combination of spreadsheets. Topics include: creation of spreadsheet; editing and deleting entries; introduction to macros, computations through the use of formula and/or logic functions; and program related spreadsheet applications. Laboratory work includes theoretical and technical applications.",
      "institution": "South Georgia Technical College"
    },
    {
      "course_id": "ACC 107",
      "course_title": "Full- Time Accounting Internship",
      "credits": "3.00",
      "description": "Prerequisite(s): All non-elective courses required for program completion. Provides in-depth application and reinforcement of accounting and employability principles in an actual job setting. Allows the student to become involved in intensive on-the-job accounting applications that require full-time concentration, practice, and follow through. Topics include, applications of accounting principles; problem solving; adaptability to job setting equipment and technology, use of proper interpersonal skills; development of constructive work habits and appropriate work ethics, with consideration of factors such as confidentiality; and concentrated development of productivity and quality job performance through practice. The full-time accounting internship is implemented through the use of written individualized training plans, written performance evaluation, minimum of two required seminars, and a required student project.",
      "institution": "South Georgia Technical College"
    },
    {
      "course_id": "ACC 108",
      "course_title": "Half- Time Accounting Internship",
      "credits": "18.00",
      "description": "Prerequisite (s): All non-elective courses required for program completion. Provides in-depth application and reinforcement of accounting and employability principles in an actual job setting. The internship acquaints the student with realistic work situation and provides insights into accounting principles; problem solving; adaptability to job setting equipment and technology; use of proper interpersonal skills; development of constructive work habits and appropriate work ethics, with consideration of factors such as confidentiality; and initial development of productivity and quality of job performance. The half-time accounting internship is implemented through the use of written individualized training plans, written performance evaluation, two required seminars.",
      "institution": "South Georgia Technical College"
    },
    {
      "course_id": "ACC 150",
      "course_title": "Cost Accounting",
      "credits": "8.00",
      "description": "Prerequisite: ACC 103 Emphasizes a thorough understanding of cost concepts, cost behavior, and cost accounting techniques as they are applied to manufacturing cost systems. Topics include job order cost accounting, process cost accounting, and standard cost accounting.",
      "institution": "South Georgia Technical College"
    },
    {
      "course_id": "ACC 151",
      "course_title": "Individual Tax Accounting",
      "credits": "5.00",
      "description": "Prerequisite: ACC 101 Provides instruction in Federal and State income tax return preparation for individuals. Topics include: dependency tests, gross income inclusions and exclusions, adjustments to income, itemized deductions, purchase and sale of principal residence, earned income credit, child care credit, small business (sole proprietor) income/loss and tax liability.",
      "institution": "South Georgia Technical College"
    }
  ],
  "timestamp": "2025-08-10T06:11:38.900514"
}