{
  "search_query": {
    "institution": "Virginia Western Community College",
    "successful_variation": "Virginia Western Community College",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Virginia+Western+Community+College&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ACC 110",
      "course_title": "Introduction to Computerized Accounting I",
      "credits": "1.00",
      "description": "(1 CR) Introduces the computer in solving accounting problems. Focuses on the operation of computers. Presents the accounting cycle and financial statement preparation in a computerized system and other applications for financial and managerial accounting. Lecture 1 hour per week.",
      "institution": "Virginia Western Community College"
    },
    {
      "course_id": "ACC 124",
      "course_title": "Payroll Accounting I",
      "credits": "3.00",
      "description": "(2 CR) Presents accounting systems and methods used in computing and recording payroll to include payroll taxes and compliance with federal and state legislation. Lecture 2-3 hours per week.",
      "institution": "Virginia Western Community College"
    },
    {
      "course_id": "ACC 211",
      "course_title": "Principles of Accounting I",
      "credits": "3.00",
      "description": "(4 CR) Prerequisite: Math and Algebra or the equivalent proficiency. Presents accounting principles and their application to various businesses. Covers the accounting cycle, income determination, and financial reporting. Studies services, merchandising, and includes internal controls. Computerized component is included. Lecture 4 hours.",
      "institution": "Virginia Western Community College"
    },
    {
      "course_id": "ACC 212",
      "course_title": "Principles of Accounting II",
      "credits": "3.00",
      "description": "(4 CR) Prerequisites: ACC 211. Continues Accounting Principles 211 with emphasis on the application to partnerships, corporations and the study of financial analysis. Includes an introduction to cost and managerial accounting. Computerized component is included. Lecture 4 hours.",
      "institution": "Virginia Western Community College"
    },
    {
      "course_id": "ACC 221",
      "course_title": "Intermediate Accounting I",
      "credits": "3.00",
      "description": "(4 CR) Prerequisites: ACC 212 or equivalent and BUS 125. Offered in fall semester only. Covers accounting principles and theory, including a review of the accounting cycle and accounting for current assets, current liabilities and investments. Introduces various accounting approaches and demonstrates the effect of these approaches on the financial statement users. Lecture 4 hours per week.",
      "institution": "Virginia Western Community College"
    },
    {
      "course_id": "ACC 231",
      "course_title": "Cost Accounting I",
      "credits": "3.00",
      "description": "(3 CR) Prerequisite: ACC 212 or equivalent. Offered in fall semester only. Studies cost-accounting methods and reporting as applied to job order, process, and standard cost accounting systems. Includes cost control and other topics. Lecture 3 hours per week.",
      "institution": "Virginia Western Community College"
    },
    {
      "course_id": "ACC 261",
      "course_title": "Principles of Federal Taxation I",
      "credits": "3.00",
      "description": "(3 CR) Prerequisite: ACC 211. Presents the study of federal taxation as it relates to individuals and related entities. Includes tax planning, compliance and reporting. Lecture 3 hours per week.",
      "institution": "Virginia Western Community College"
    },
    {
      "course_id": "ADJ 100",
      "course_title": "Survey of Criminal Justice",
      "credits": "3.00",
      "description": "(3 CR) Presents an overview of the United States criminal justice system; introduces the major system components-law enforcement, judiciary, and corrections. Lecture 3 hours per week.",
      "institution": "Virginia Western Community College"
    },
    {
      "course_id": "ADJ 105",
      "course_title": "The Juvenile Justice System",
      "credits": "3.00",
      "description": "(3 CR) Presents the evolution, philosophy, structures and processes of the American juvenile delinquency system; surveys the rights of juveniles, dispositional alternatives, rehabilitation methods and current trends. Lecture 3 hours per week.",
      "institution": "Virginia Western Community College"
    },
    {
      "course_id": "ADJ 107",
      "course_title": "Survey of Criminology",
      "credits": "3.00",
      "description": "(3 CR) Surveys the volume and scope of crime; considers a variety of theories developed to explain the causation of crime and criminality. Lecture 3 hours per week.",
      "institution": "Virginia Western Community College"
    }
  ],
  "timestamp": "2025-08-10T19:26:56.309217"
}