{
  "search_query": {
    "institution": "Wilson Community College",
    "successful_variation": "Wilson Community College",
    "url": "https://www.collegetransfer.net/Search/Search-for-Courses/Course-Search-Results?instnm=Wilson+Community+College&distance=5"
  },
  "total_results": 10,
  "courses": [
    {
      "course_id": "ACA 111",
      "course_title": "College Student Success",
      "credits": "1.00",
      "description": "Prerequisites: None Corequisites: None This course introduces the college's physical, academic, and social environment and promotes the personal development essential for success. Topics include campus facilities and resources; policies, procedures, and programs; study skills; and life management issues such as health, self-esteem, motivation, goal-setting, diversity, and communication. Upon completion, students should be able to function effectively within the college environment to meet their educational objectives. This course is also available through the Virtual Learning Community (VLC).",
      "institution": "Wilson Community College"
    },
    {
      "course_id": "ACA 122",
      "course_title": "College Transfer Success",
      "credits": "1.00",
      "description": "Prerequisites: None Corequisites: None This course provides information and strategies necessary to develop clear academic and professional goals beyond the community college experience. Topics include CAA, college culture, career exploration, gathering information on senior institutions, strategic planning, critical thinking, and communications skills for a successful academic transition. Upon completion, students should be able to develop an academic plan to transition successfully to senior institutions. This course has been approved to satisfy the Comprehensive Articulation Agreement for transferability as a pre-major and/or elective course requirement.",
      "institution": "Wilson Community College"
    },
    {
      "course_id": "ACC 120",
      "course_title": "Principles of Financial Accounting",
      "credits": "4.00",
      "description": "Prerequisites: None Corequisites: None This course introduces business decision-making accounting information systems. Emphasis is placed on analyzing, summarizing, reporting, and interpreting financial information. Upon completion, students should be able to prepare financial statements, understand the role of financial information in decision-making and address ethical considerations. This course has been approved to satisfy the Comprehensive Articulation Agreement pre-major and/or elective course requirement. This course is also available through the Virtual Learning Community (VLC).",
      "institution": "Wilson Community College"
    },
    {
      "course_id": "ACC 121",
      "course_title": "Principles of Managerial Accounting",
      "credits": "4.00",
      "description": "Prerequisites: ACC 120 (state) Corequisites: None This course includes a greater emphasis on managerial and cost accounting skills. Emphasis is placed on managerial accounting concepts for external and internal analysis, reporting and decision-making. Upon completion, students should be able to analyze and interpret transactions relating to managerial concepts including product-costing systems. This course has been approved to satisfy the Comprehensive Articulation Agreement pre-major and/or elective course requirement. This course is also available through the Virtual Learning Community (VLC).",
      "institution": "Wilson Community College"
    },
    {
      "course_id": "ACC 122",
      "course_title": "Principles of Financial Accounting II",
      "credits": "3.00",
      "description": "Prerequisites: ACC 120 (state) Corequisites: None This course provides additional instruction in the financial accounting concepts and procedures introduced in ACC 120. Emphasis is placed on the analysis of specific balance sheet accounts, with in-depth instruction of the accounting principles applied to these accounts. Upon completion, students should be able to analyze data, prepare journal entries, and prepare reports in compliance with generally accepted accounting principles.",
      "institution": "Wilson Community College"
    },
    {
      "course_id": "ACC 129",
      "course_title": "Individual Income Taxes",
      "credits": "3.00",
      "description": "Prerequisites: None Corequisites: None This course introduces the relevant laws governing individual income taxation. Topics include tax law, electronic research and methodologies, and the use of technology for preparation of individual tax returns. Upon completion, students should be able to analyze basic tax scenarios, research applicable tax law, and complete various individual tax forms. This course is also available through the Virtual Learning Community (VLC).",
      "institution": "Wilson Community College"
    },
    {
      "course_id": "ACC 130",
      "course_title": "Business Income Taxes",
      "credits": "3.00",
      "description": "Prerequisites: None Corequisites: None This course introduces the relevant laws governing business and fiduciary income taxes. Topics include tax law relating to business organizations, electronic research and methodologies, and the use of technology for the preparation of business tax returns. Upon completion, students should be able to analyze basic tax scenarios, research applicable tax law, and complete various business tax forms. This course is also available through the Virtual Learning Community (VLC).",
      "institution": "Wilson Community College"
    },
    {
      "course_id": "ACC 140",
      "course_title": "Payroll Accounting",
      "credits": "2.00",
      "description": "Prerequisites: ACC 115 or ACC 120 (state) Corequisites: None This course covers federal and state laws pertaining to wages, payroll taxes, payroll tax forms, and journal and general ledger transactions. Emphasis is placed on computing wages; calculating social security, income, and unemployment taxes; preparing appropriate payroll tax forms; and journalizing/posting transactions. Upon completion, students should be able to analyze data, make appropriate computations, complete forms, and prepare accounting entries using appropriate technology. This course is also available through the Virtual Learning Community (VLC).",
      "institution": "Wilson Community College"
    },
    {
      "course_id": "ACC 149",
      "course_title": "Introduction to Accounting Spreadsheets",
      "credits": "2.00",
      "description": "Prerequisites: ACC 115 or ACC 120 (state) Corequisites: None This course provides a working knowledge of computer spreadsheets and their use in accounting. Topics include pre-programmed problems, model-building problems, beginning-level macros, graphics, and what-if analysis enhancements of template problems. Upon completion, students should be able to use a computer spreadsheet to complete many of the tasks required in accounting.",
      "institution": "Wilson Community College"
    },
    {
      "course_id": "ACC 150",
      "course_title": "Accounting Software Applications",
      "credits": "2.00",
      "description": "Prerequisites: ACC 115 or ACC 120 (state) Corequisites: None This course introduces microcomputer applications related to accounting systems. Topics include general ledger, accounts receivable, accounts payable, inventory, payroll, and correcting, adjusting, and closing entries. Upon completion, students should be able to use a computer accounting package to solve accounting problems. This course is also available through the Virtual Learning Community (VLC).",
      "institution": "Wilson Community College"
    }
  ],
  "timestamp": "2025-08-10T17:09:00.109161"
}